In [1]:
# importing all necessary libraries 
import pandas as pd

In [4]:
# Uploading th file 
df=pd.read_csv("Emp by sector and region.csv")

# Data Preparation

In [15]:
#Displaying the first and last 10 rows of the data. This give us an overview of how the dataset is structured
df.head(10)

,Statistic Label,Year,Region,Sector,UNIT,VALUE
0,Total Employment,2000,Ireland,All selected NACE sectors ( A-S),Person,310464.0
1,Total Employment,2000,Ireland,"Agriculture, forestry & fishing, mining & quar...",Person,52452.0
2,Total Employment,2000,Ireland,"Traditional Manufacturing (13 -18, 22-25, 28-3...",Person,90200.0
3,Total Employment,2000,Ireland,"Modern Manufacturing (19-21, 26-27, 325)",Person,87248.0
4,Total Employment,2000,Ireland,"Energy, Water, Waste & Construction (D to F)",Person,6751.0
5,Total Employment,2000,Ireland,Information & Communication Services (J),Person,54032.0
6,Total Employment,2000,Ireland,"Selected services (G to I, K to S)",Person,19779.0
7,Total Employment,2000,Border,All selected NACE sectors ( A-S),Person,24385.0
8,Total Employment,2000,Border,"Agriculture, forestry & fishing, mining & quar...",Person,6631.0
9,Total Employment,2000,Border,"Traditional Manufacturing (13 -18, 22-25, 28-3...",Person,10537.0

In [16]:
df.tail(10)

,Statistic Label,Year,Region,Sector,UNIT,VALUE
1376,Total Employment,2021,Mid East,"Energy, Water, Waste & Construction (D to F)",Person,1242.0
1377,Total Employment,2021,Mid East,Information & Communication Services (J),Person,4045.0
1378,Total Employment,2021,Mid East,"Selected services (G to I, K to S)",Person,5293.0
1379,Total Employment,2021,Midlands,All selected NACE sectors ( A-S),Person,15408.0
1380,Total Employment,2021,Midlands,"Agriculture, forestry & fishing, mining & quar...",Person,3772.0
1381,Total Employment,2021,Midlands,"Traditional Manufacturing (13 -18, 22-25, 28-3...",Person,4661.0
1382,Total Employment,2021,Midlands,"Modern Manufacturing (19-21, 26-27, 325)",Person,2563.0
1383,Total Employment,2021,Midlands,"Energy, Water, Waste & Construction (D to F)",Person,599.0
1384,Total Employment,2021,Midlands,Information & Communication Services (J),Person,2608.0
1385,Total Employment,2021,Midlands,"Selected services (G to I, K to S)",Person,1205.0

In [7]:
#To understand the number of rows and columns in the dataset
df.shape

(1386, 6)

In [20]:
#To view the total number of values across the whole dataset
employment_size = df.size
print (df.size)

8316

In [9]:
#Viewing the data types
df.dtypes

Statistic Label     object
Year                 int64
Region              object
Sector              object
UNIT                object
VALUE              float64
dtype: object

There are two numerical variables (Year and Value) and four qualitative variables (Region, Sector, Unit, Statistic Label).

In [23]:
#Dropping irrelevant columns
df=df.drop(["Statistic Label","UNIT"], axis=1)
df

,Year,Region,Sector,VALUE
0,2000,Ireland,All selected NACE sectors ( A-S),310464.0
1,2000,Ireland,"Agriculture, forestry & fishing, mining & quar...",52452.0
2,2000,Ireland,"Traditional Manufacturing (13 -18, 22-25, 28-3...",90200.0
3,2000,Ireland,"Modern Manufacturing (19-21, 26-27, 325)",87248.0
4,2000,Ireland,"Energy, Water, Waste & Construction (D to F)",6751.0
...,...,...,...,...
1381,2021,Midlands,"Traditional Manufacturing (13 -18, 22-25, 28-3...",4661.0
1382,2021,Midlands,"Modern Manufacturing (19-21, 26-27, 325)",2563.0
1383,2021,Midlands,"Energy, Water, Waste & Construction (D to F)",599.0
1384,2021,Midlands,Information & Communication Services (J),2608.0
1385,2021,Midlands,"Selected services (G to I, K to S)",1205.0

In [30]:
#Checking for duplicate
duplicates=df[df.duplicated()]
print("number of duplicate rows:", duplicates.shape)

number of duplicate rows: (0, 4)

There is no duplicated data in the dataset

In [24]:
#Viewing unique values in sector column
df["Sector"].unique()

array(['All selected NACE sectors ( A-S)',
       'Agriculture, forestry & fishing, mining & quarrying, food, beverages and tobacco (A, B, 10, 11,12)',
       'Traditional Manufacturing (13 -18, 22-25, 28-32.4, 32.9-33)',
       'Modern Manufacturing\xa0(19-21, 26-27, 325)',
       'Energy, Water, Waste & Construction (D to F)',
       'Information & Communication Services (J)',
       'Selected services (G to I, K to S)'], dtype=object)

In [31]:
#Viewing unique values in sector column
df["Year"].unique()

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021],
      dtype=int64)

In [32]:
#Viewing unique values in sector column
df["Region"].unique()

array(['Ireland', 'Border', 'West', 'Mid West', 'South East',
       'South West', 'Dublin', 'Mid East', 'Midlands'], dtype=object)

In [25]:
df.isnull().sum()

Year       0
Region     0
Sector     0
VALUE     76
dtype: int64

In [53]:
#To delete null values
df_without_null = df.dropna()
print(df_without_null)

      Year    Region                                             Sector  \
0     2000   Ireland                   All selected NACE sectors ( A-S)
1     2000   Ireland  Agriculture, forestry & fishing, mining & quar...
2     2000   Ireland  Traditional Manufacturing (13 -18, 22-25, 28-3...
3     2000   Ireland           Modern Manufacturing (19-21, 26-27, 325)
4     2000   Ireland       Energy, Water, Waste & Construction (D to F)
...    ...       ...                                                ...
1381  2021  Midlands  Traditional Manufacturing (13 -18, 22-25, 28-3...
1382  2021  Midlands           Modern Manufacturing (19-21, 26-27, 325)
1383  2021  Midlands       Energy, Water, Waste & Construction (D to F)
1384  2021  Midlands           Information & Communication Services (J)
1385  2021  Midlands                 Selected services (G to I, K to S)

         VALUE
0     310464.0
1      52452.0
2      90200.0
3      87248.0
4       6751.0
...        ...
1381    4661.0
1382    2563.0
1383     599.0
1384    2608.0
1385    1205.0

[1310 rows x 4 columns]

In [54]:
#To confirm that there are no more null values
df_without_null.isnull().sum()

Year      0
Region    0
Sector    0
VALUE     0
dtype: int64

In [55]:
# To clean description of the sectors and get rid of information in brackets
pattern = r'\([^)]*\)'
df_without_null['Sector'] = df_without_null['Sector'].replace(pattern, '', regex=True)
df_without_null

C:\Users\learn\AppData\Local\Temp\ipykernel_9368\2178555163.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_without_null['Sector'] = df_without_null['Sector'].replace(pattern, '', regex=True)

,Year,Region,Sector,VALUE
0,2000,Ireland,All selected NACE sectors,310464.0
1,2000,Ireland,"Agriculture, forestry & fishing, mining & quar...",52452.0
2,2000,Ireland,Traditional Manufacturing,90200.0
3,2000,Ireland,Modern Manufacturing,87248.0
4,2000,Ireland,"Energy, Water, Waste & Construction",6751.0
...,...,...,...,...
1381,2021,Midlands,Traditional Manufacturing,4661.0
1382,2021,Midlands,Modern Manufacturing,2563.0
1383,2021,Midlands,"Energy, Water, Waste & Construction",599.0
1384,2021,Midlands,Information & Communication Services,2608.0
1385,2021,Midlands,Selected services,1205.0

In [75]:
#Some values are representing totals for all sectors, to find out how many row:
value_to_count_allsectors = 'All selected NACE sectors '
count = (df_without_null['Sector'] == value_to_count_allsectors).sum()
print(f'Number of rows with value "{value_to_count_allsectors}": {count}')

Number of rows with value "All selected NACE sectors ": 198

In [76]:
#Some values are representing totals for Ireland, to find out how many row:
value_to_count_Ireland ='Ireland'
count = (df_without_null['Region'] == value_to_count_Ireland).sum()
print(f'Number of rows with value "{value_to_count_Ireland}": {count}')

Number of rows with value "Ireland": 154

In [88]:
#Some values are representing both totals for Ireland and for the Sectors, to find out how many row:
count = len(df_without_null[(df_without_null['Region'] == value_to_count_Ireland) & (df_without_null['Sector'] == value_to_count_allsectors)])
print(f'Number of rows with both values "{value_to_count_Ireland}" in the Region column and "{value_to_count_allsectors}" in the Sector column: {count}')

Number of rows with both values "Ireland" in the Region column and "All selected NACE sectors " in the Sector column: 22

In [93]:
#Remove the totals in columns Sectors and Regions
values_to_remove_region = 'Ireland'
values_to_remove_sector = 'All selected NACE sectors ' 
filtered_df = df_without_null[(df_without_null['Region'] != values_to_remove_region) & (df_without_null['Sector'] != values_to_remove_sector)]
filtered_df

,Year,Region,Sector,VALUE
8,2000,Border,"Agriculture, forestry & fishing, mining & quar...",6631.0
9,2000,Border,Traditional Manufacturing,10537.0
10,2000,Border,Modern Manufacturing,6129.0
15,2000,West,"Agriculture, forestry & fishing, mining & quar...",2552.0
16,2000,West,Traditional Manufacturing,7033.0
...,...,...,...,...
1381,2021,Midlands,Traditional Manufacturing,4661.0
1382,2021,Midlands,Modern Manufacturing,2563.0
1383,2021,Midlands,"Energy, Water, Waste & Construction",599.0
1384,2021,Midlands,Information & Communication Services,2608.0
1385,2021,Midlands,Selected services,1205.0

Number of raws is 980, which is correct: 1310 - 154 -198 + 22= 980

In [95]:
filtered_df.describe()

              Year         VALUE
count   980.000000    980.000000
mean   2011.044898   6695.898980
std       6.221320   7787.612738
min    2000.000000     26.000000
25%    2006.000000   2333.500000
50%    2011.000000   5104.500000
75%    2016.000000   8327.500000
max    2021.000000  79486.000000

The table above shows correct representation of the data as it is free from Null values and totals